{
  "users": [
    {
      "id": "1",
      "username": "teacher-one",
      "fullname": "John luca",
      "email": "johndoe@example.com",
      "password": "testingpassword",
      "role": "teacher"
    },
    {
      "id": "2",
      "username": "student-one",
      "fullname": "Jane Doe",
      "email": "janedoe@example.com",
      "password": "12ne6",
      "role": "student"
    },
    {
      "id": "3",
      "username": "Miguel",
      "fullname": "Joe Jota",
      "email": "asdasd@gmail.com",
      "password": "miguel123",
      "role": "student"
    },
    {
      "id": "4",
      "username": "kanariandev",
      "fullname": "Miguel",
      "email": "asdasd@gmail.com",
      "password": "miguel123",
      "role": "teacher"
    },
    {
      "id": "5",
      "username": "asd",
      "fullname": "asdasdas",
      "email": "asdasdasd@gmail.com",
      "password": "qweqwasdas",
      "role": "student"
    }
  ],
  "students": [
    {
      "id": "1",
      "userId": 2
    },
    {
      "id": "2",
      "userId": 4
    },
    {
      "id": "3",
      "userId": 6
    }
  ],
  "teachers": [
    {
      "id": "1",
      "userId": 1
    },
    {
      "id": "2",
      "userId": 3
    },
    {
      "id": "3",
      "userId": 5
    }
  ],
  "games": [
    {
      "id": "1",
      "tag": "Algebra",
      "name": "Calculo Mental",
      "description": "¡Bienvenido a 'Calculo Mental'! El juego donde sumar, restar, multiplicar y dividir nunca ha sido tan emocionante. Únete a nuestros intrépidos personajes en su misión por resolver problemas matemáticos en tiempo récord y salvar la tierra de los errores aritméticos. ¡Demuestra que eres el maestro del cálculo y diviértete mientras desafías tu mente con desafíos numéricos! Calculatopia: donde hasta las ecuaciones más complejas se convierten en diversión desenfrenada.",
      "total_score": "100"
    },
    {
      "id": "2",
      "tag": "Arithmetic",
      "name": "FracPizza",
      "description": "¡Bienvenido a 'FracPizza', el juego donde puedes aprender sobre fracciones de una manera deliciosa. Únete a nuestro chef pizzero en la cocina y aprende a dividir pizzas en fracciones mientras preparas las pizzas más deliciosas. Desde medias pizzas hasta octavos, este juego te enseñará todo sobre fracciones de una manera divertida y sabrosa. ¡Prepárate para una experiencia de aprendizaje que te dejará con ganas de más!",
      "total_score": "200"
    },
    {
      "id": "3",
      "tag": "Geometry",
      "name": "Versusmatic",
      "description": "¡Bienvenido a 'Versusmatic', donde los números se convierten en poderosos aliados en batallas épicas! En este emocionante juego multijugador, podrás entrenar a tus MathMons, criaturas mágicas que representan diferentes conceptos matemáticos, como sumas, restas, multiplicaciones y divisiones. Desafía a otros jugadores a duelos donde el conocimiento matemático y la estrategia son clave para la victoria. ¡Conviértete en el Maestro MathMon y demuestra que eres el mejor en batallas donde la mente es tu mayor arma!",
      "total_score": "150"
    }
  ],
  "rooms": []
}